Repository: RyanZhou416/ClipBridge
Catalog: platforms/windows/ClipBridgeShell_*/ClipBridgeShell_*/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AppDisplayName
source: Clip Bridge
zh_cn: 剪切桥

# AppName.Text
source: Clip Bridge
zh_cn: 剪切桥

# Shell_Main.Content
source: Main
zh_cn: 仪表盘

# Shell_Devices.Content
source: Devices
zh_cn: 设备

# Shell_Logs.Content
source: Logs
zh_cn: 日志

# Settings_Personalization.Text
source: Personalization
zh_cn: 个性化

# Settings_Theme.Header
source: Theme
zh_cn: 主题

# Settings_Theme_Light.Content
source: Light
zh_cn: 浅色模式

# Settings_Theme_Dark.Content
source: Dark
zh_cn: 深色模式

# Settings_Theme_Default.Content
source: Default
zh_cn: 默认

# Settings_LanguageCombo.Header
source: Language
zh_cn: 语言

# Settings_LanguageCombo.PlaceholderText
source: Pick a language
zh_cn: 选择一种语言

# Settings_Lang_English.Content
source: English
zh_cn: 英语 - English

# Settings_Lang_Chinese.Content
source: Simplified Chinese - 简体中文
zh_cn: 简体中文

# Settings_LanguageCombo.Description
source: Switching is instant. No restart needed.
zh_cn: 立即生效，无需重启。

# Shell_Settings.Text
source: Settings
zh_cn: 设置

# Settings_Reset_SettingsCard.Header
source: Reset settings
zh_cn: 重置设置

# Settings_ResetConfirm_Title
source: Reset settings?
zh_cn: 确认重置？

# Settings_ResetConfirm_Primary
source: Reset
zh_cn: 重置

# Settings_ResetConfirm_Secondary
source: Cancel
zh_cn: 取消

# Settings_ResetDone
source: Settings have been reset
zh_cn: 已重置设置

# Settings_ResetConfirm_Content
source: This will clear all your preferences to default
zh_cn: 这将清除你的首选项为默认

# MainPage_Header
source: Main
zh_cn: 主页

# Settings_Reset_SettingsCard.Description
source: Irreversible!
zh_cn: 不可恢复！

# Settings_Reset_Button.Content
source: Reset settings
zh_cn: 重置设置

# Settings_ShowLocalFolder_SettingsCard.Description
source: Show Local Folder
zh_cn: 仅供测试

# Settings_ShowLocalFolder_SettingsCard.Header
source: Show LocalFolder Path
zh_cn: 显示 LocalFolder 路径

# Settings_ShowLocalFolder_Button.Content
source: Show LocalFolder Path
zh_cn: 显示 LocalFolder 路径

# Settings_IsClipboardCaptureEnabled_SettingsCard.Header
source: Enable Clipboard Capture
zh_cn: 启用剪切板监听

# Settings_Debugging.Text
source: Debugging
zh_cn: 开发选项

# Settings_Clip.Text
source: Clip
zh_cn: 剪切板

# Settings_IsClipboardCaptureEnabled_ToggleSwitch.OnContent
source: Active
zh_cn: 启用

# Settings_IsClipboardCaptureEnabled_ToggleSwitch.OffContent
source: Pause
zh_cn: 暂停

# Shell_History.Content
source: History
zh_cn: 历史

# Settings_Database
source: Database
zh_cn: 数据库

# Settings_DeleteCloudDb_SettingsCard.Header
source: Delete cloud database
zh_cn: 删除元数据库

# Settings_DeleteCloudDb_SettingsCard.Description
source: Delete the local metadata database (core.db). This will remove history and item metadata on this device.
zh_cn: 删除本地元数据数据库（core.db）。这将移除此设备上的历史记录和项目元数据。

# Settings_DeleteCloudDb_Button.Content
source: Delete database
zh_cn: 删除数据库

# Settings_DeleteCache_SettingsCard.Header
source: Delete cache
zh_cn: 删除缓存

# Settings_DeleteCache_SettingsCard.Description
source: Delete cached content blobs and temporary files (CAS).
zh_cn: 删除缓存内容块和临时文件（CAS）。

# Settings_DeleteCache_Button.Content
source: Delete cache
zh_cn: 删除缓存

# Settings_DeleteCloudDbConfirm_Title
source: Delete Meta database?
zh_cn: 删除元数据库？

# Settings_DeleteCloudDbConfirm_Content
source: This action cannot be undone. The app will restart the core.
zh_cn: 此操作无法撤销。应用程序将重启核心。

# Settings_DeleteCloudDbConfirm_Primary
source: Delete
zh_cn: 删除

# Settings_DeleteCloudDbConfirm_Secondary
source: Cancel
zh_cn: 取消

# Settings_DeleteCloudDbDone
source: Database deleted.
zh_cn: 数据库已删除。

# Settings_DeleteCloudDbFailed
source: Failed to delete database.
zh_cn: 删除数据库失败。

# Settings_DeleteCacheConfirm_Title
source: Delete cache?
zh_cn: 删除缓存？

# Settings_DeleteCacheConfirm_Content
source: This action cannot be undone. The app will restart the core.
zh_cn: 此操作无法撤销。应用程序将重启核心。

# Settings_DeleteCacheConfirm_Primary
source: Delete
zh_cn: 删除

# Settings_DeleteCacheConfirm_Secondary
source: Cancel
zh_cn: 取消

# Settings_DeleteCacheDone
source: Cache deleted.
zh_cn: 缓存已删除。

# Settings_DeleteCacheFailed
source: Failed to delete cache.
zh_cn: 删除缓存失败。

# Settings_ClearLocalCert_SettingsCard.Header
source: Clear Local Certificate
zh_cn: 清除本地证书

# Settings_ClearLocalCert_SettingsCard.Description
source: Clear local TLS certificate and private key. This will require all connected devices to re-pair.
zh_cn: 清除本地 TLS 证书和私钥。这将导致所有已连接的设备需要重新配对。

# Settings_ClearLocalCert_Button.Content
source: Clear Local Certificate
zh_cn: 清除本地证书

# Settings_ClearLocalCertConfirm_Title
source: Clear Local Certificate?
zh_cn: 清除本地证书？

# Settings_ClearLocalCertConfirm_Content
source: This will delete the local TLS certificate and private key. All connected devices will need to re-pair. This action cannot be undone.
zh_cn: 此操作将删除本地 TLS 证书和私钥。所有已连接的设备将需要重新配对。此操作无法撤销。

# Settings_ClearLocalCertConfirm_Primary
source: Clear
zh_cn: 清除

# Settings_ClearLocalCertConfirm_Secondary
source: Cancel
zh_cn: 取消

# Settings_ClearLocalCertDone
source: Local Certificate Cleared
zh_cn: 本地证书已清除

# Settings_ClearLocalCertDone_Content
source: Local certificate and private key have been successfully cleared. A new certificate will be generated after the application restarts, and all devices will need to re-pair.
zh_cn: 本地证书和私钥已成功清除。应用程序重启后将生成新的证书，所有设备需要重新配对。

# Settings_ClearLocalCertFailed
source: Failed to clear local certificate
zh_cn: 清除本地证书失败

# LogsPage_SearchBox.PlaceholderText
source: Search...
zh_cn: 搜索...

# LogsPage_AutoScroll.Header
source: Auto Scroll
zh_cn: 自动滚动

# LogsPage_ScrollToBottomButton.Content
source: Scroll to Bottom
zh_cn: 滚动到底部

# LogsPage_TailButton.Content
source: Tail
zh_cn: 跟踪

# LogsPage_StopButton.Content
source: Stop
zh_cn: 停止

# LogsPage_RefreshButton.Content
source: Refresh
zh_cn: 刷新

# LogsPage_TestLogButton.Content
source: Test Log (Toggle)
zh_cn: 测试日志（切换）

# LogsPage_ClearViewButton.Content
source: Clear View
zh_cn: 清空视图

# LogsPage_CopyButton.Content
source: Copy
zh_cn: 复制

# LogsPage_ExportCsvButton.Content
source: Export CSV
zh_cn: 导出 CSV

# LogsPage_DeleteSelectedButton.Content
source: Delete Selected
zh_cn: 删除选中

# LogsPage_DeleteAllButton.Content
source: Delete All
zh_cn: 删除全部

# LogsPage_StatsButton.Content
source: Stats
zh_cn: 统计

# LogsPage_ExceptionPrefix
source: | Exception:
zh_cn: | 异常:

# DevicesPage_SharingSummary.Text
source: Sharing Summary
zh_cn: 共享摘要

# DevicesPage_OutboundAllowed.Text
source: Outbound allowed:
zh_cn: 允许出站:

# DevicesPage_InboundAllowed.Text
source: Inbound allowed:
zh_cn: 允许入站:

# DevicesPage_Devices.Text
source: devices
zh_cn: 设备

# DevicesPage_RefreshButton.Content
source: Refresh
zh_cn: 刷新

# DevicesPage_DevicesTitle.Text
source: Devices
zh_cn: 设备

# DevicesPage_State.Text
source: State:
zh_cn: 状态:

# DevicesPage_LastSeen.Text
source: Last seen:
zh_cn: 最后看到:

# DevicesPage_ShareTo.Header
source: Share To
zh_cn: 共享到

# DevicesPage_AcceptFrom.Header
source: Accept From
zh_cn: 接受来自

# DevicesPage_Menu_ShareTo.Text
source: Share to this device
zh_cn: 共享到此设备

# DevicesPage_Menu_AcceptFrom.Text
source: Accept from this device
zh_cn: 接受来自此设备

# DevicesPage_Menu_CopyInfo.Text
source: Copy device info
zh_cn: 复制设备信息

# DevicesPage_Menu_SetAlias.Text
source: Set local alias
zh_cn: 设置本地别名

# DevicesPage_Menu_ClearFingerprint.Text
source: Clear device fingerprint
zh_cn: 清除设备指纹

# MainPage_RecentItems.Text
source: Recent Items
zh_cn: 最近项目

# MainPage_ViewMoreHistory.Content
source: View more history...
zh_cn: 查看更多历史...

# MainPage_Sharing.Text
source: Sharing
zh_cn: 共享

# MainPage_Outbound.Text
source: Outbound:
zh_cn: 出站:

# MainPage_Inbound.Text
source: Inbound:
zh_cn: 入站:

# MainPage_Devices.Text
source: devices
zh_cn: 设备

# MainPage_LocalResources.Text
source: Local Resources
zh_cn: 本地资源

# MainPage_Cache.Text
source: Cache:
zh_cn: 缓存:

# MainPage_ActiveTransfers.Text
source: Active Transfers:
zh_cn: 活动传输:

# MainPage_Controls.Text
source: Controls
zh_cn: 控制

# MainPage_ClipboardCapture.Header
source: Clipboard Capture
zh_cn: 剪贴板捕获

# MainPage_ClipboardSharing.Header
source: Clipboard Sharing
zh_cn: 剪贴板共享

# MainPage_ClearCache.Content
source: Clear Cache
zh_cn: 清空缓存

# MainPage_Statistics.Text
source: Statistics
zh_cn: 统计

# MainPage_CacheUsage.Text
source: Cache Usage Over Time
zh_cn: 缓存使用情况（时间）

# MainPage_NetworkThroughput.Text
source: Network Throughput
zh_cn: 网络吞吐量

# MainPage_GlobalCopyActivity.Text
source: Global Copy Activity (24h)
zh_cn: 全局复制活动（24小时）

# MainPage_ConnectedDevices.Text
source: Connected Devices
zh_cn: 已连接设备

# MainPage_From.Text
source: From:
zh_cn: 来自:

# MainPage_NoPreview.Text
source: (No preview)
zh_cn: （无预览）

# MainPage_LockButton.Content
source: Lock
zh_cn: 锁定

# MainPage_DeleteButton.Content
source: Delete
zh_cn: 删除

# HistoryPage_SearchBox.PlaceholderText
source: Search history...
zh_cn: 搜索历史记录...

# HistoryPage_AllTypes.PlaceholderText
source: All types
zh_cn: 所有类型

# HistoryPage_AllTypes.Content
source: All types
zh_cn: 所有类型

# HistoryPage_TypeText.Content
source: Text
zh_cn: 文本

# HistoryPage_TypeImage.Content
source: Image
zh_cn: 图片

# HistoryPage_TypeFile.Content
source: File
zh_cn: 文件

# HistoryPage_NoPreview.Text
source: (No preview)
zh_cn: （无预览）

# HistoryPage_CopyButton.Content
source: Copy
zh_cn: 复制

# ShellPage_CoreUnavailable.Title
source: Core unavailable
zh_cn: 核心不可用

# ShellPage_ActionsButton.Content
source: Actions
zh_cn: 操作

# ShellPage_Menu_Retry.Text
source: Retry
zh_cn: 重试

# ShellPage_Menu_CopyDiagnostics.Text
source: Copy diagnostics
zh_cn: 复制诊断信息

# ShellPage_Menu_OpenLogs.Text
source: Open Logs
zh_cn: 打开日志

# Settings_CoreService_SettingsCard.Header
source: Core Service
zh_cn: 核心服务

# Settings_CoreService_SettingsCard.Description
source: Enable or disable core service
zh_cn: 开启或关闭核心服务

# Settings_RecentItemsCount_SettingsCard.Header
source: Recent Items Count
zh_cn: 主页显示的卡片数量

# Settings_RecentItemsCount_SettingsCard.Description
source: Set the number of cards displayed in the Recent Items area on the main page (1-50)
zh_cn: 设置主页 Recent Items 区域显示的卡片数量（1-50）

# Settings_DeleteStatsDb_SettingsCard.Header
source: Clear Statistics
zh_cn: 清空统计数据

# Settings_DeleteStatsDb_SettingsCard.Description
source: Clear all statistics (cache usage, network throughput, activity statistics, etc.)
zh_cn: 清空所有统计数据（缓存使用、网络吞吐、活动统计等）

# Settings_DeleteStatsDb_Button.Content
source: Clear Statistics
zh_cn: 清空统计数据

# LogsLevelFilter_Title.Text
source: Level Filter
zh_cn: 级别过滤

# LogsLevelFilter_ResetButton.Content
source: Reset
zh_cn: 重置

# LogsCategoryFilter_Title.Text
source: Category Filter
zh_cn: 分类过滤

# LogsCategoryFilter_ResetButton.Content
source: Reset
zh_cn: 重置

# LogsComponentFilter_Title.Text
source: Component Filter
zh_cn: 组件过滤

# LogsComponentFilter_ResetButton.Content
source: Reset
zh_cn: 重置

# LogsFilter_TimeRange.Text
source: Time Range
zh_cn: 时间范围

# LogsFilter_StartTimeUnlimited.Content
source: Start time: Unlimited
zh_cn: 开始时间：无限

# LogsFilter_EndTimeNow.Content
source: End time: Now
zh_cn: 结束时间：现在

# LogsFilter_Level.Text
source: Level
zh_cn: 级别

# LogsFilter_Component.Text
source: Component
zh_cn: 组件

# LogsFilter_Category.Text
source: Category
zh_cn: 分类

# LogsFilter_ResetButton.Content
source: Reset
zh_cn: 重置

# LogsFilter_ApplyButton.Content
source: Apply
zh_cn: 应用

# LogsTimestampFilter_Title.Text
source: Time Range Filter
zh_cn: 时间范围过滤

# LogsTimestampFilter_StartTimeUnlimited.Content
source: Start time: Unlimited
zh_cn: 开始时间：无限

# LogsTimestampFilter_EndTimeNow.Content
source: End time: Now
zh_cn: 结束时间：现在

# LogsTimestampFilter_ResetButton.Content
source: Reset
zh_cn: 重置

# LogsPage_FilterLevelButton.Content
source: Filter: Level
zh_cn: 过滤：级别

# LogsPage_FilterComponentButton.Content
source: Filter: Component
zh_cn: 过滤：组件

# LogsPage_FilterCategoryButton.Content
source: Filter: Category
zh_cn: 过滤：分类

# LogsPage_FilterTimeButton.Content
source: Filter: Time
zh_cn: 过滤：时间

# LogsPage_ResetFiltersButton.Content
source: Reset Filters
zh_cn: 重置过滤
